#-は長音,.は短音
puts "モールス符号を入力してください"
morse_in = gets.chomp

#英単語ファイル
f = File.open("dictionary.txt")
s = f.read 
f.close

morse_in{".-" => "a","-..." => "b", "-.-." => "c", "-.." => "d", 
         "." => "e", "..-." => "f", "--." => "g", "...." => "h", 
         ".." => "i", ".---" => "j", "-.-" => "k", ".-.." => "l",
         "--" => "m", "-." => "n", "---" => "o", ".--." => "p",
         "--.-" => "q", ".-." => "r", "..." => "s", "-" => "t",
         "..-" => "u", "...-" => "v", ".--" => "w", "-..-" => "x"
         "-.--" => "y", "--.." => "z"}

def main(morse_in)
    morse_in.each do |mo|
        mo[] .--.---..-.-.
end
    main(morse_in)

